Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings Constructor
Initializes a new instance of the TeklaStructuresSettings class
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaStructuresSettings()
Public Sub New
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace